#+html_doctype: html5
#+title: Leetcode: Check If a String Can Break Another String
#+date: <2020-05-12 Tue 22:28>
#+filetags: leetcode python permutations
In this post we're going to solve a medium Leetcode problem called "[[https://leetcode.com/problems/check-if-a-string-can-break-another-string/][Check If a String Can Break Another String]]", number 1433. It's nothing special, I just randomly clicked on a link and got there.
** Brute-force search
For [[https://en.wikipedia.org/wiki/Brute-force_search][exhaustive search]] we need to generate all permutations of both strings and check if there's a pair of permutations $(A, B)$, where $A$ is a permutation of string $s1$ and $B$ is a permutation of string $s2$, such that $A$ breaks $B$ or $B$ breaks $A$.

At first, let's define a function, that says if a string breaks another string:

#+begin_src python
def breaks(A, B): return all(a >= b for a, b in zip(A, B))
#+end_src

#+RESULTS:

#+begin_src shell
echo $PATH
#+end_src

#+RESULTS:
: /run/wrappers/bin:/home/me/.nix-profile/bin:/etc/profiles/per-user/me/bin:/nix/var/nix/profiles/default/bin:/run/current-system/sw/bin

The [[https://en.wikipedia.org/wiki/Time_complexity][time complexity]] of this function is $\Theta(n)$.

Python has [[https://docs.python.org/3/library/itertools.html#itertools.permutations][~itertools.permutations~]] function and it makes the bruteforce solution very simple:

#+begin_src python
from itertools import permutations

def check_if_can_break(s1: str, s2: str) -> bool:
    return any(breaks(A, B) or breaks(B, A)
               for A in permutations(s1)
               for B in permutations(s2))
#+end_src

~permutations(s1)~ returns a generator that yields tuples (e.g. ~('x', 'y', 'z')~), not strings. But it doesn't matter in our case, as the ~breaks~ function works with any iterables.

What is the time complexity of this solution? To answer this question we need to know the complexity of ~permutations~. Sometimes I forget the answer, but it's very easy to derive it. For instance, if we need to generate all permutations of string ~"xyz"~, we can put 3 different characters at the first position: ~x~, ~y~, or ~z~. When we have the first spot claimed, we are left with 2 characters, for example, ~y~ and ~z~, if we chose ~x~ before. So we put ~y~ or ~z~ on the second spot, and we're left with only 1 character for the last spot. From this we can see, that the total number of permutations of the string ~"xyz"~ is $3 * 2 * 1 = 6$, in other words it's $3!$, and the number of permutations of a string of length $n$ is $n!$.

Now we can find the complexity of the solution. We have two nested loops. Each runs for $n!$ iterations and there's $\Theta(n)$ call to ~breaks~ function in the inner loop. Thus, the complexity is $O(n!n!n) = O(n!^2 n)$. If $n = 10^5$, then the algorithm will take $10^5! 10^5! 10 \approx 8 * 10^{913151}$ operations to finish. That's a lot.

We know that all strings consist of lowercase English letters. Thus we have only 26 different characters in our strings.

How many permutations are there of the string ~"free"~? The formula gives us $4! = 24$. But in fact there are only 12: ~{"free", "fere", "feer", "rfee", "refe", "reef", "efre", "erfe", "eref", "eefr", "eerf", "efer"}~. That formula is only true if all characters in the string are unique. The more general formula looks like this: $\frac{n!}{m_1! m_2! \dots m_{26}!}$, where $m_i$ is the number of an \(i\)-th letter occurences in a string. See [[https://en.wikipedia.org/wiki/Binomial_coefficient#Generalization_to_multinomials][Multinomial coefficients]] for details. So for the string ~"free"~ that gives us $\frac{4!}{2!} = 12$.

What is the worst case, smallest, denominator? It's when we have the equal amount of all letters, i.e. $m_i = \lfloor\frac{n}{26}\rfloor$.

Then the complexity of our solution can potentially be lowered down to (double check me here)

$$O\left(\left(\frac{n!}{\left(\lfloor\frac{n}{26}\rfloor!\right)^{26}}\right)^2 n\right) .$$

For $n = 10^5$ that gives us around $1.5 * 10^{282920}$ operations. Quite an improvement! But still more operations than nanoseconds since the birth of the Universe.

And to get to this complexity we need to generate only unique permutations. There are algorithms for that:

  - [[https://link.springer.com/chapter/10.1007/3-540-46632-0_25][An $O(1)$ Time Algorithm for Generating Multiset Permutations]] by Tadao Takaoka ([[https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.77.6275&rep=rep1&type=pdf][PDF]])
  - Loopless Generation of Multiset Permutations by Prefix Shifts by Aaron Williams ([[https://pdfs.semanticscholar.org/3dbb/b8ded50b1e78bbe2b569704faca959588682.pdf][PDF]])

References were found on [[https://stackoverflow.com/questions/19676109/how-to-generate-all-the-permutations-of-a-multiset/][StackOverflow]]. There are simpler slower approaches. But in any case, the brute-force search is too slow, even if we'd have ~unique_permutations~ function. We need another approach.
